topic_101/system_initialization/journalctl.org
#+title: Journalctl
#+author: Gabriel Ferreira

* Journalctl

Utilizado para ler logs do sistema e logs de inicialização também. Faz parte do SystemD (systemd-journald) com a finalidade de coletar e armazenar Logs

Verificar os logs de inicialização ->
#+begin_src sh
journalctl -b
#+end_src

Verificar somente os logs do Kernel ->
#+begin_src sh
journalctl -k
#+end_src

Ler logs de serviço específico ->
#+begin_src sh
journalctl -u NetworkManager.service

journalctl -u cron.service
#+end_src
